docs/cpt.org
#+TITLE: Carbs Packaging Tools
#+SUBTITLE: User Manual
#+AUTHOR: Cem Keylan
#+EMAIL: cem@ckyln.com
#+TEXINFO_FILENAME: cpt.info
#+TEXINFO_DIR_CATEGORY: Development
#+TEXINFO_DIR_TITLE: Carbs Packaging Tools: (cpt)
#+TEXINFO_DIR_DESC: Carbs Package Management Library
#+DATE: {{{modification-time(%B %d\, %Y, 1)}}}

This is a reference document containing both the user-guide and the development
manual for *Carbs Packaging Tools*. For development logs see [[https://git.carbslinux.org/cpt][the git repository]].

* Table of Contents                                            :TOC:noexport:
- [[#copying][Copying]]
- [[#preface][Preface]]
- [[#usage][Usage]]
  - [[#cpt-alternatives][cpt-alternatives]]
  - [[#cpt-build][cpt-build]]
  - [[#cpt-checksum][cpt-checksum]]
  - [[#cpt-download][cpt-download]]
  - [[#cpt-install][cpt-install]]
  - [[#cpt-list][cpt-list]]
  - [[#cpt-remove][cpt-remove]]
  - [[#cpt-search][cpt-search]]
  - [[#cpt-update][cpt-update]]
  - [[#global-flags][Global Flags]]
- [[#environment-variables][Environment Variables]]
  - [[#cpt_path][=CPT_PATH=]]
  - [[#cpt_compress][=CPT_COMPRESS=]]
  - [[#cpt_force][=CPT_FORCE=]]
  - [[#cpt_pid][=CPT_PID=]]
- [[#hooks][Hooks]]
  - [[#editing-the-build-file-during-pre-build][Editing the =build= file during pre-build]]
- [[#packaging-system][Packaging System]]
  - [[#build][=build=]]
  - [[#sources][=sources=]]
  - [[#checksums][=checksums=]]
  - [[#version][=version=]]
  - [[#depends][=depends=]]
  - [[#post-install][=post-install=]]
  - [[#message][=message=]]
  - [[#test][=test=]]
- [[#rsync-repositories][Rsync Repositories]]
  - [[#setting-up-an-rsync-repository][Setting up an Rsync repository]]
- [[#cpt-library][CPT Library]]
  - [[#calling-the-library][Calling the library]]
  - [[#option-parsing][Option parsing]]
  - [[#message-functions][Message functions]]
  - [[#text-functions][Text functions]]
  - [[#portability-functions][Portability functions]]
  - [[#system-functions][System Functions]]
  - [[#package-functions][Package Functions]]

* Copying
:PROPERTIES:
:COPYING:  t
:END:

Copyright \copy 2020 Cem Keylan

#+begin_quote
Permission is granted to copy, distribute and/or modify this document under the
terms of the GNU Free Documentation License, Version 1.3 or any later version
published by the Free Software Foundation; with no Invariant Sections, with no
Front-Cover Texts and no Back-Cover Texts. A copy of the license is included in
the section entitled "GNU Free Documentation License."
#+end_quote

* Preface
:PROPERTIES:
:DESCRIPTION: Introduction to Carbs Packaging Tools
:END:

Carbs Linux uses its own package management toolchain named =cpt= which was
initially forked from the [[https://github.com/kisslinux/kiss][kiss]] package manager. Unlike =kiss=, however, its main
goal is being easily extendable. Instead of being a single file package manager,
it revolves around the shell library =cpt-lib=, and many tools that wrap around
it. This document aims to document both the usage of the distributed tools and
document the library functions.

* Usage
:PROPERTIES:
:DESCRIPTION: Basic usage of Carbs Packaging Tools
:END:

=cpt= is formed of many tools combined in a single environment, similar to
=git=. When you run =cpt= without any arguments, it will show all available
tools and their explanations. Here is an example call with extra scripts on my
system:

#+BEGIN_EXAMPLE
  -> Carbs Packaging Tool
  -> add               Commit the current directory as a new package
  -> alternatives      List and swap to alternatives
  -> build             Build a package
  -> bump              Commit the current directory as a version bump
  -> cargo-urlgen      Create static cargo sources for Rust packages
  -> cargolock-urlgen  Convert the given Cargo.lock file to sources
  -> cat               Concatanate package files in the installed package database
  -> changelog         Print the git log of the specific package
  -> chbuild           Create/destroy temporary chroots
  -> checkmissing      Verify package manifests
  -> checksum          Generate checksums
  -> chroot            Enter a chroot
  -> commit            Commit a package without the prefix of 'package:'
  -> depends           Display a package's dependencies
  -> download          Download sources for the given package
  -> exec              Execute a command inside the alternatives system
  -> export            Turn an installed package into a CPT tarball
  -> fork              Fork a package to the current directory
  -> getchoice         Prints the full path to a file in the alternatives system.
  -> install           Install a package
  -> link              Link a forked package's files to the other repository
  -> list              List installed packages
  -> maintainer        Find the maintainer of a package
  -> manifest          Display all files owned by a package
  -> manifest-tree     Display all files owned by a package with a tree view
  -> new               Create a boilerplate CPT package
  -> orphans           List orphaned packages
  -> owns              Check which package owns a file
  -> rel               Bump the release number of a package
  -> remove            Remove a package
  -> repodepends       Display a package's dependencies in the repository
  -> reporevdepends    Display packages on the repository which depend on package
  -> reset             Remove all packages except for the base
  -> revdepends        Display packages which depend on package
  -> search            Search for a package
  -> size              Show the size on disk for a package
  -> source            Extract sources of a given package to the current directory
  -> update            Check for updates
#+END_EXAMPLE

** cpt-alternatives
:PROPERTIES:
:DESCRIPTION: List and swap to alternatives
:END:

You can list and swap to alternatives using =cpt-alternatives=, or
=cpt a= for short. When run without alternatives, it will list
alternatives. It can read from standard input if =-= is given as an
argument.

*Examples*

1. List alternatives.

#+BEGIN_EXAMPLE
  $ cpt-alternatives
  ncurses /usr/bin/clear
  ncurses /usr/bin/reset
#+END_EXAMPLE

2. Swap to =clear= from =ncurses=.

#+BEGIN_EXAMPLE
  $ cpt-alternatives ncurses /usr/bin/clear
  -> Swapping '/usr/bin/clear' from 'busybox' to 'ncurses'
#+END_EXAMPLE

3. Swap in bulk (all of =sbase=).

#+BEGIN_EXAMPLE
  $ cpt a | grep ^sbase | cpt a -
#+END_EXAMPLE

** cpt-build
:PROPERTIES:
:DESCRIPTION: Build a package
:END:

=cpt-build= will build given packages and their dependencies. If multiple
packages are specified, it will ask to install the packages as well.

| Flags          | Explanation  |
|----------------+--------------|
| =-t=, =--test= | Run tests    |

** cpt-checksum
:PROPERTIES:
:DESCRIPTION: Generate checksums
:END:

=cpt-checksum= will generate a =checksums= file from the package's sources.

** cpt-download
:PROPERTIES:
:DESCRIPTION: Download sources for the given package
:END:

=cpt-download= will download the sources of a package.

** cpt-install
:PROPERTIES:
:DESCRIPTION: Install a package
:END:

=cpt-install= will install given packages.

** cpt-list
:PROPERTIES:
:DESCRIPTION: List installed packages
:END:

When called without arguments, =cpt-list= will print all installed
packages. You can add package names as arguments to check whether they are
installed or not. In success, =cpt-list= will exit with status 0 if all
given packages are installed, it will return 1 if any of the given packages
aren't installed.

| Flags             | Explanation                            |
|-------------------+----------------------------------------|
| =-c=, =--current= | Use the current directory as a package |

** cpt-remove
:PROPERTIES:
:DESCRIPTION: Remove a package
:END:

=cpt-remove= will remove given packages.

