docs/cpt.txt
			_______________________

			 CARBS PACKAGING TOOLS
			      User Manual

			       Cem Keylan
			_______________________


			   February 04, 2021


Table of Contents
_________________

1. Copying
2. Preface
3. Usage
.. 1. cpt-alternatives
.. 2. cpt-build
.. 3. cpt-checksum
.. 4. cpt-download
.. 5. cpt-install
.. 6. cpt-list
.. 7. cpt-remove
.. 8. cpt-search
.. 9. cpt-update
.. 10. Global Flags
4. Environment Variables
.. 1. `CPT_PATH'
..... 1. Repository preferences
..... 2. Setting the `CPT_PATH'
.. 2. `CPT_COMPRESS'
.. 3. `CPT_FORCE'
.. 4. `CPT_PID'
5. Hooks
.. 1. Editing the `build' file during pre-build
6. Packaging System
.. 1. `build'
.. 2. `sources'
.. 3. `checksums'
.. 4. `version'
.. 5. `depends'
.. 6. `post-install'
.. 7. `message'
.. 8. `test'
7. Rsync Repositories
.. 1. Setting up an Rsync repository
8. CPT Library
.. 1. Calling the library
.. 2. Option parsing
..... 1. Defining a parser
..... 2. `global_options()'
.. 3. Message functions
..... 1. `out()'
..... 2. `log()'
..... 3. `die()'
..... 4. `warn()'
..... 5. `prompt()'
.. 4. Text functions
..... 1. `contains()'
..... 2. `regesc()'
..... 3. `pop()'
..... 4. `sepchar()'
.. 5. Portability functions
..... 1. `_seq()'
..... 2. `_stat()'
..... 3. `_readlinkf()'
.. 6. TODO System Functions
..... 1. `as_root()'
.. 7. TODO Package Functions
..... 1. `pkg_owner()'
..... 2. `pkg_isbuilt()'
..... 3. `pkg_lint()'
..... 4. TODO `pkg_find()'
..... 5. TODO `pkg_gentree'


This is a reference document containing both the user-guide and the
development manual for *Carbs Packaging Tools*. For development logs see
[the git repository].


[the git repository] <https://git.carbslinux.org/cpt>


1 Copying
=========

  Copyright (c) 2020 Cem Keylan

        Permission is granted to copy, distribute and/or modify
        this document under the terms of the GNU Free
        Documentation License, Version 1.3 or any later version
        published by the Free Software Foundation; with no
        Invariant Sections, with no Front-Cover Texts and no
        Back-Cover Texts. A copy of the license is included in the
        section entitled "GNU Free Documentation License."


2 Preface
=========

  Carbs Linux uses its own package management toolchain named `cpt'
  which was initially forked from the [kiss] package manager. Unlike
  `kiss', however, its main goal is being easily extendable. Instead of
  being a single file package manager, it revolves around the shell
  library `cpt-lib', and many tools that wrap around it. This document
  aims to document both the usage of the distributed tools and document
  the library functions.


[kiss] <https://github.com/kisslinux/kiss>


3 Usage
=======

  `cpt' is formed of many tools combined in a single environment,
  similar to `git'. When you run `cpt' without any arguments, it will
  show all available tools and their explanations. Here is an example
  call with extra scripts on my system:

  ,----
  | -> Carbs Packaging Tool
  | -> add               Commit the current directory as a new package
  | -> alternatives      List and swap to alternatives
  | -> build             Build a package
  | -> bump              Commit the current directory as a version bump
  | -> cargo-urlgen      Create static cargo sources for Rust packages
  | -> cargolock-urlgen  Convert the given Cargo.lock file to sources
  | -> cat               Concatanate package files in the installed package database
  | -> changelog         Print the git log of the specific package
  | -> chbuild           Create/destroy temporary chroots
  | -> checkmissing      Verify package manifests
  | -> checksum          Generate checksums
  | -> chroot            Enter a chroot
  | -> commit            Commit a package without the prefix of 'package:'
  | -> depends           Display a package's dependencies
  | -> download          Download sources for the given package
  | -> exec              Execute a command inside the alternatives system
  | -> export            Turn an installed package into a CPT tarball
  | -> fork              Fork a package to the current directory
  | -> getchoice         Prints the full path to a file in the alternatives system.
  | -> install           Install a package
  | -> link              Link a forked package's files to the other repository
  | -> list              List installed packages
  | -> maintainer        Find the maintainer of a package
  | -> manifest          Display all files owned by a package
  | -> manifest-tree     Display all files owned by a package with a tree view
  | -> new               Create a boilerplate CPT package
  | -> orphans           List orphaned packages
  | -> owns              Check which package owns a file
  | -> rel               Bump the release number of a package
  | -> remove            Remove a package
  | -> repodepends       Display a package's dependencies in the repository
  | -> reporevdepends    Display packages on the repository which depend on package
  | -> reset             Remove all packages except for the base
  | -> revdepends        Display packages which depend on package
  | -> search            Search for a package
  | -> size              Show the size on disk for a package
  | -> source            Extract sources of a given package to the current directory
  | -> update            Check for updates
  `----


3.1 cpt-alternatives
~~~~~~~~~~~~~~~~~~~~

  You can list and swap to alternatives using `cpt-alternatives', or
  `cpt a' for short. When run without alternatives, it will list
  alternatives. It can read from standard input if `-' is given as an
  argument.

  *Examples*

  1. List alternatives.

  ,----
  | $ cpt-alternatives
  | ncurses /usr/bin/clear
  | ncurses /usr/bin/reset
  `----

  1. Swap to `clear' from `ncurses'.

  ,----
  | $ cpt-alternatives ncurses /usr/bin/clear
  | -> Swapping '/usr/bin/clear' from 'busybox' to 'ncurses'
  `----

  1. Swap in bulk (all of `sbase').

  ,----
  | $ cpt a | grep ^sbase | cpt a -
  `----


3.2 cpt-build
~~~~~~~~~~~~~

  `cpt-build' will build given packages and their dependencies. If
  multiple packages are specified, it will ask to install the packages
  as well.

   Flags           Explanation 
  -----------------------------
   `-t', `--test'  Run tests   


3.3 cpt-checksum
~~~~~~~~~~~~~~~~

  `cpt-checksum' will generate a `checksums' file from the package's
  sources.


3.4 cpt-download
~~~~~~~~~~~~~~~~

  `cpt-download' will download the sources of a package.


3.5 cpt-install
~~~~~~~~~~~~~~~

  `cpt-install' will install given packages.


3.6 cpt-list
~~~~~~~~~~~~

  When called without arguments, `cpt-list' will print all installed
  packages. You can add package names as arguments to check whether they
  are installed or not. In success, `cpt-list' will exit with status 0
  if all given packages are installed, it will return 1 if any of the
  given packages aren't installed.

   Flags              Explanation                            
  -----------------------------------------------------------
   `-c', `--current'  Use the current directory as a package 


3.7 cpt-remove
~~~~~~~~~~~~~~

  `cpt-remove' will remove given packages.


3.8 cpt-search
~~~~~~~~~~~~~~
