docs/cpt.txt

  `cpt-search' will search for packages, it accepts regular expressions
  as well.

   Flags             Explanation                               
  -------------------------------------------------------------
   `-s', `--single'  Only show the first instance of a package 


  ,----
  | $ cpt-search 'alsa-*'
  | /var/db/cpt/repo/extra/alsa-lib
  | /var/db/cpt/repo/extra/alsa-utils
  | /var/db/cpt/installed/alsa-lib
  | /var/db/cpt/installed/alsa-utils
  | 
  | $ cpt-search emacs
  | /home/cem/repos/main/community/emacs
  | /home/cem/repos/kiss-community/community/emacs
  | /var/db/cpt/installed/emacs
  | 
  | $ cpt-search --single emacs
  | /home/cem/repos/main/community/emacs
  `----


3.9 cpt-update
~~~~~~~~~~~~~~

  `cpt-update' will update the packages on your system. It fetches
  remote repositories, and builds, and installs packages that have
  versions different from the ones installed on the system. It doesn't
  check if the version string is actually higher, it only checks whether
  they differ.

   Flags                 Explanation                          
  ------------------------------------------------------------
   `-d', `--download'    Only download updatable packages     
   `-n', `--no-fetch'    Do not update remote repositories    
   `-o', `--only-fetch'  Only fetch the repositories and exit 


3.10 Global Flags
~~~~~~~~~~~~~~~~~

   Flags                Explanation                        
  ---------------------------------------------------------
   `-f', `--force'      Force operation, [See `CPT_FORCE'] 
   `-y', `--no-prompt'  Do not prompt for confirmation     
   `-root CPT_ROOT'     Use an alternate root directory    
   `-h', `--help'       Show this help message             
   `-v', `--version'    Print version information          


[See `CPT_FORCE'] See section 4.3


4 Environment Variables
=======================

  Since there is no configuration file for cpt, the package manager is
  configured through environment variables. These can be set per
  operation, or be set to your shell configuration or `~/.profile'. Here
  are the environment variables that alter the behaviour of `cpt':

   ENVIRONMENT VARIABLE  Effects                                                                       
  -----------------------------------------------------------------------------------------------------
   `CPT_PATH'            Set the locations of your repositories. It is similar to the `PATH' variable. 
   `XDG_CACHE_HOME'      Unless this is set, the `~/.cache' directory will be used instead.            
   `CPT_CACHE'           The cache directory for `cpt'. Default: `$XDG_CACHE_HOME/cpt'                 
   `CPT_CHOICE'          If this is set to 0, a package installation will be aborted on conflicts.     
   `CPT_COMPRESS'        Program used to compress package tarballs.                                    
   `CPT_DEBUG'           If set to 1, temporary directories will not be removed after the operation.   
   `CPT_FETCH'           If set to 0, `cpt-update' will not fetch repositories.                        
   `CPT_FORCE'           Force operation.                                                              
   `CPT_HOOK'            Location for the hook file.                                                   
   `CPT_KEEPLOG'         If set to 1, cpt will keep logs regardless of operation success.              
   `CPT_PID'             Set the temporary build directory name.                                       
   `CPT_PROMPT'          If set to 0, `cpt' will not prompt you for anything.                          
   `CPT_ROOT'            If this variable is set, `cpt' will assume this as the system root.           
   `CPT_TEST'            If set to 1, `cpt-build' will run tests whenever available.                   
   `CPT_TMPDIR'          The directory to create the temporary directories.                            


4.1 `CPT_PATH'
~~~~~~~~~~~~~~

  Similar to the `PATH' variable, `cpt' find repositories from the
  `CPT_PATH' variable. Here is an example:

  ,----
  | CPT_PATH=$HOME/repos/repo1:$HOME/repos/repo2:$HOME/repos/repo3
  `----

  This is a simplistic and a structured example for repository
  locations, but it doesn't necessarily need to be as tidy as the
  example above. Here is an example for something a little more complex.

  ,----
  | CPT_PATH=$HOME/repos/overrides:/var/db/cpt/repo/core:/var/db/cpt/repo/extra:$HOME/repos/personal
  `----

  This example brings us to the next section of this document.


4.1.1 Repository preferences
----------------------------

  When you are using multiple repositories from multiple vendors, you
  will find out that some repositories have the same packages. `cpt'
  doesn't care about conflicting packages. If you want to build a
  package that exists on multiple repositories, `cpt' will build the
  first matching package. This means that if `grep' package (for the
  sake of an example) exists on both `$HOME/repos/personal' and
  `$HOME/repos/carbs/extra', and you want to install from your personal
  repository, you must set `CPT_PATH' so that your personal repository
  is listed before the `extra' repository.

  ,----
  | CPT_PATH=$HOME/repos/personal:$HOME/repos/carbs/extra
  `----


4.1.2 Setting the `CPT_PATH'
----------------------------

  You can set the `CPT_PATH' variable on your shell configuration or
  your `.profile' file in a way that is easy to read.

  The below example sets `CPT_PATH' in a way that is easy to understand
  which repository comes first:

  ,----
  | CPT_PATH=$HOME/repos/overrides
  | CPT_PATH=$CPT_PATH:$HOME/repos/carbs/core
  | CPT_PATH=$CPT_PATH:$HOME/repos/carbs/extra
  | CPT_PATH=$CPT_PATH:$HOME/repos/carbs/xorg
  | CPT_PATH=$CPT_PATH:$HOME/repos/personal
  | export CPT_PATH
  `----


4.2 `CPT_COMPRESS'
~~~~~~~~~~~~~~~~~~

  When setting the `CPT_COMPRESS' value, you should set the name of the
  default suffixes for the program. Available values are:

  - `gz'
  - `zst'
  - `bz2'
  - `xz'

  Defaults to `gz'.


4.3 `CPT_FORCE'
~~~~~~~~~~~~~~~

  If this is set to 1, some of the `cpt' tools will continue regardless
  of errors or skip certain checks. Here are some examples:

  - `cpt-install' will install a package without verifying its manifest.
  - `cpt-install' will install a package even when there are missing
    dependencies.
  - `cpt-remove' will remove packages even when there are other packages
    that depend on the current package.

  Defaults to 0.


4.4 `CPT_PID'
~~~~~~~~~~~~~

  If this variable is set, the temporary files will be created with this
  variable as the suffix, instead of the PID of the `cpt' process. The
  advantage is that you can know exactly where the build directory is
  located, while the disadvantage is that there will be issues with
  multiple operations at the same time. So the best way to use this
  variable is during one-time `cpt' calls.

  ,----
  | CPT_PID=mesa cpt b mesa
  `----

  By running the above, you will know that the created build directories
  will end with the `*-mesa' suffix.


5 Hooks
=======
