docs/cpt.txt

  Rsync repositories are simple to serve and simple to use. In the
  repository directory, there needs to be a `.rsync' file that points to
  the remote of the repository. This is used in order to fetch changes
  from the upstream. `.rsync' file looks like this for the core
  repository:

  ,----
  | rsync://carbslinux.org/repo/core
  `----

  Rsync repositories have some few distinctions when it comes to
  fetching them.  They can be either synced individually or as a
  "root". There are 2 important files, those are `.rsync' and
  `.rsync_root'. Here is the Carbs Linux rsync repository structure.

  ,----
  |            /
  |    -----------------
  |   |                |
  | .rsync           core/
  |           ----------------
  |           |              |
  |         .rsync      .rsync_root
  `----

  Unlike git repositories, they don't have a defined "root"
  directory. This is both an advantage and a disadvantage. This way, we
  can sync individual repositories, but that also means we need extra
  files to define root directories and repository locations. Here is the
  content for each of these files:

  ,----
  | /.rsync:           rsync://carbslinux.org/repo
  | /core/.rsync:      rsync://carbslinux.org/repo/core
  | /core/.rsync_root: ..
  `----

  The `.rsync_root' file on the core repository points to the upper
  directory.  If a `.rsync' file exists on the upper directory, this
  means that is the whole repository and will sync the entire repository
  instead of each individual repository.

  If the upper directory doesn't have this `.rsync' file, this means
  that this is an individual repository, and the package manager will
  fetch accordingly.


7.1 Setting up an Rsync repository
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

  Carbs Linux repositories automatically sync from the git repostitories
  and serve it through the rsync daemon. Here is a sample shell script
  that I use in order to sync repositories. Feel free to customize for
  your own use.

  ,----
  | #!/bin/sh
  | HOSTNAME="rsync://carbslinux.org/repo"
  | GITDIR="/pub/git/repo"
  | SHAREDIR="/pub/share/repo"
  | git -C "$GITDIR" pull
  | 
  | rsync -avcC --delete --include=core --exclude=.rsync,.rsync_root "$GITDIR/." "$SHAREDIR"
  | 
  | printf '%s\n' "$HOSTNAME" > "$GITDIR/.rsync"
  | for dir in "$GITDIR/"*; do
  |     [ -d "$dir" ] || continue
  |     [ -f "$dir/.rsync" ] ||
  |     printf '%s/%s\n' "$HOSTNAME" "${dir##*/}" > "$dir/.rsync"
  |     printf '..\n' > "$dir/.rsync_root"
  | done
  `----

  You can then create an *rsync* user for serving the repositories.

  ,----
  | $ adduser -SD rsync
  `----

  Create `/etc/rsyncd.conf' and a service configuration as well.

  ,----
  | uid = rsync
  | gid = rsync
  | address = example.com
  | max connections = 10
  | use chroot = yes
  | 
  | [repo]
  |     path = /pub/share/repo
  |     comment = My repository
  `----

  Create a service file at `/etc/sv/rsync/run' (runit):

  ,----
  | #!/bin/sh -e
  | exec rsync --daemon --no-detach
  `----


8 CPT Library
=============

  `cpt-lib' is the library of Carbs Packaging Tools which can be used to
  extend the functionality of the package manager. This is the API
  documentation of the package manager library.


8.1 Calling the library
~~~~~~~~~~~~~~~~~~~~~~~

  You can call the library on your scripts by adding the following line
  to your files:

  ,----
  | #!/bin/sh -e
  | . cpt-lib
  `----

  This will load the library inside your script, and will set some
  environment variables that are used inside the package manager.


8.2 Option parsing
~~~~~~~~~~~~~~~~~~

  `cpt-lib' includes a POSIX-shell option parser inside named
  `getoptions'. You can see its own [documentation] for writing an
  option parser. The built-in version of the `getoptions' library is
  2.0.1 and there are no plans for updating it apart from bug fixes.


[documentation]
<https://github.com/ko1nksm/getoptions/blob/v2.0.1/README.md>

8.2.1 Defining a parser
-----------------------

  Some functions are called and set automatically when you call
  `cpt-lib', so you shouldn't define the option parser after calling the
  library, as some of the variables will already be set.

  If the function `parser_definition()' as defined when `cpt-lib' is
  called, cpt-lib will handle the option parsing itself by calling
  `getoptions' inside. Here is the proper way of doing it.

  ,----
  | #!/bin/sh -e
  | 
  | parser_definition() {
  |     # The rest arguments MUST be defined as 'REST'
  |     setup REST help:usage -- "usage: ${0##*/} [options] [pkg...]"
  |     msg                   -- '' 'Options:'
  |     flag CPT_TEST -t export:1 init:@export -- "Enable tests"
  | 
  |     global_options
  | }
  | 
  | . cpt-lib
  `----


8.2.2 `global_options()'
------------------------

  The `global_options()' function is a simple convenience call to
  include flags that can be used inside most `cpt' tools. It defines the
  following flags:

   Flag  Long Option  Calls        
  ---------------------------------
   -f    --force      `CPT_FORCE'  
   -y    --no-prompt  `CPT_PROMPT' 
         --root       `CPT_ROOT'   
   -h    --help       `usage()'    
   -v    --version    `version()'  


8.3 Message functions
~~~~~~~~~~~~~~~~~~~~~

  `cpt' has various functions to print information to users.


8.3.1 `out()'
-------------

  `out()' is a really simple function that prints messages to the
  standard output. It prints every argument with a newline. It is not
  meant to communicate with the user, it just exists to have a simple
  function to interact with other functions.

  ,----
  | $ out "This is an example call" "How are you?"
  | This is an example call
  | How are you?
  `----


8.3.2 `log()'
-------------

  `log()' is the most commonly used message function in the package
  manager. It is used to pretty print messages with visual cues, so it
  is easier to read and understand for the users. It changes message
  output for each argument it receives (takes up to three arguments).

  - If it takes a single argument, it prints a yellow leading arrow
    followed by colorless text.
  - If it takes two arguments, it prints a yellow leading arrow followed
    by the first argument (colored blue), and then followed by colorless
    second argument.
  - If it takes three arguments, instead of a yellow arrow, it prints
    the third argument in yellow, followed by the same two arguments as
    above.


8.3.3 `die()'
-------------

  `die()' wraps the `log()' function and exits with an error (1). It
  takes one or two arguments, which are sent to the `log()'
  function. The third argument for `log()' is set as `!>'.


8.3.4 `warn()'
--------------

  `warn()' is another function that wraps `log()'. In place of the third
  argument, it uses the word `WARNING'.


8.3.5 `prompt()'
----------------

  `prompt()' is an interactive function that waits for user input to
  continue.  It takes a single argument string to print a message, and
  then asks the user whether they want to continue or not. Prompts can
  be disabled by the user if they use a flag to disable them or set
  `CPT_PROMPT' to 0.


8.4 Text functions
~~~~~~~~~~~~~~~~~~

  Following functions are used to manipulate, check, or interact with
  text.


8.4.1 `contains()'
------------------

  `contains' function can be used to check whether a list variable
  contains a given string. If the string is inside the list, it will
  return 0, otherwise 1.

  ,----
  | # Usage
  | contains "$LIST" foo
  | 
  | contains "foo bar" foo  # Returns 0
  | contains "foo bar" baz  # Returns 1
  `----


8.4.2 `regesc()'
----------------
